{    "en": {
        "answer": "Answer:",
        "comment": "Comment",
        "yes": "yes",
        "hateful": "hateful",
        "no": "no",
        "non_hateful": "non-hateful",

    "general": "Is the following comment hateful? Respond only with {yn1} or {yn2}. No explanations. No explanations.\nComment: \"{text}\"\nAnswer:",

    "classification": "Classify the following comment as either hateful or non-hateful. Respond with {yn1} for hateful and {yn2} for non-hateful. No explanations.\nComment: \"{text}\"\nAnswer:",

    "definition": "Hate speech is language that expresses discrimination, hostility, or violence against individuals or groups based on race, religion, ethnicity, nationality, gender, sexual orientation, or disability.\n\nDoes the following comment contain hate speech? Answer only {yn1} or {yn2}. No explanations.\nComment: \"{text}\"\nAnswer:",

    "cot": "Analyze the following comment step by step to determine if it contains hate speech.\n\nStep 1: Identify if the comment **targets a specific person or group** based on race, religion, ethnic origin, national origin, sex, disability, sexual orientation, or gender identity. If no target is identified, the comment is not hate speech.\n\nStep 2: Assess whether the language expresses **hostility, discrimination, incitement to violence, dehumanization, or derogatory stereotypes** toward the target.\n\nStep 3: Consider **contextual factors** such as sarcasm, historical significance, and coded language. Does the comment still qualify as hate speech when context is considered?\n\nStep 4: Based on the above steps, **conclude whether this is hate speech** (answer only {yn1} or {yn2}).\n No explanations.\nComment: \"{text}\"\n\nAnswer:",

    "multilingual": "Analyze the following text written in {language}.\nConsider cultural context, idioms, and societal norms in {language}-speaking communities.\n\nText: \"{text}\"\n\nDoes this text contain hate speech? No explanations. Answer only {yn1} or {yn2}.\nAnswer:",

    "nli": "Premise: \"{text}\"\nHypothesis: \"This statement contains hate speech as defined by social and legal standards.\"\nDoes the premise entail the hypothesis? (No explanations. Answer only {yn1} or {yn2})\nAnswer:",

    "role_play": "You are a community moderator responsible for ensuring compliance with hate speech policies.\nAnalyze the following text and determine if it violates the guidelines.\n\nText: \"{text}\"\n\nDoes this text violate the community’s hate speech policy? (No explanations and Answer only {yn1} or {yn2}).\nAnswer:",

    "few_shot": "Classify the following comment as either hateful or non-hateful. Respond with 'yes' for hateful and 'no' for non-hateful, considering following examples:\n\n{examples}\n\nNow, classify this comment: No explanations.\nComment: \"{text}\"\nAnswer:",

    "few_shot_cot": "Here are some examples of comments and their classifications as 'yes' if it is hateful or 'no' if not:\n\n{examples}\n\nNow, analyze the following comment step by step and determine if it is hateful.\n No explanations.\nComment: \"{text}\"\n\nStep 1: Identify any offensive or harmful language targeting a person or group.\nStep 2: Determine if the language attacks based on attributes such as race, religion, ethnic origin, national origin, sex, disability, sexual orientation, or gender identity.\nStep 3: Conclude whether it is hate speech (No explanations. Answer only {yn1} or {yn2}).\n\nAnswer:",

    "few_shot_role_play": "As a community moderator, you have previously handled the following cases if they include hate speech or not:\n\n{examples}\n\nBased on these examples, analyze the following comment and determine if it violates the community’s hate speech policy.\n No explanations.\nComment: \"{text}\"\n\nDoes this comment violate the community guidelines on hate speech? (answer only {yn1} or {yn2})\nAnswer:",

    "multilingual_definition": "In {language}-speaking communities, hate speech is defined as language that expresses discrimination, hostility, or violence against individuals or groups based on race, religion, ethnicity, nationality, gender, sexual orientation, or disability.\n\nAnalyze the following text written in {language} considering cultural context, idioms, and societal norms.\n\nText: \"{text}\"\n\nDoes this text contain hate speech? No explanations. Answer only {yn1} or {yn2}.\nAnswer:",

    "role_play_cot": "You are a community moderator responsible for enforcing hate speech policies. Analyze the following comment step by step to determine if it violates these policies.\n No explanations.\nComment: \"{text}\"\n\nStep 1: Identify any offensive or harmful language targeting a person or group.\nStep 2: Assess if the language attacks based on attributes such as race, religion, ethnic origin, national origin, sex, disability, sexual orientation, or gender identity.\nStep 3: Determine if the comment violates the community’s hate speech policy.\n\nDoes this comment violate the community guidelines on hate speech? (answer only {yn1} or {yn2})\nAnswer:",

    "few_shot_multilingual": "Here are examples of comments in {language} and their classifications as 'yes' if it is hateful or 'no' if not::\n\n{examples}\n\nNow, analyze the following comment written in {language} and determine if it is hateful.\n No explanations.\nComment: \"{text}\"\n\nIs this comment hateful? (answer only {yn1} or {yn2})\nAnswer:",

    "few_shot_definition": "Hate speech is defined as language that expresses discrimination, hostility, or violence against individuals or groups based on race, religion, ethnicity, nationality, gender, sexual orientation, or disability. Here are some examples:\n\n{examples}\n\nNow, classify the following comment:\n No explanations.\nComment: \"{text}\"\n\nIs this comment hateful? Answer only {yn1} or {yn2}\nAnswer:",

    "multilingual_cot": "Analyze the following text written in {language} step by step, considering cultural context, idioms, and societal norms in {language}-speaking communities.\n\nText: \"{text}\"\n\nStep 1: Identify any offensive or harmful language targeting a person or group.\nStep 2: Determine if the language attacks based on attributes such as race, religion, ethnic origin, national origin, sex, disability, sexual orientation, or gender identity.\nStep 3: Conclude whether it is hate speech.\n\nDoes this text contain hate speech? (No explanations. Answer only {yn1} or {yn2})\nAnswer:",

    "explanation_based": "Analyze the following comment and determine if it contains hate speech. Provide a brief explanation for your decision.\n \nComment: \"{text}\"\n\nIs this comment hateful? (answer only {yn1} or {yn2})\nAnswer:\nExplanation:",

    "target_identification": "Identify the target group, if any, in the following comment. Then, determine if it contains hate speech.\n \nComment: \"{text}\"\n\nHate speech? (answer only {yn1} or {yn2})\nAnswer:\nTarget group (if applicable):",

    "contextual_analysis": "Consider the context of the following comment, including the target audience and potential impact. Does this comment contain hate speech? Answer only {yn1} or {yn2}. No explanations.\nComment: \"{text}\"\nAnswer:",

     "cot-2": "Analyze the following comment step by step to determine if it contains hate speech.\n\nStep 1: Identify if the comment **targets a specific person or group** based on race, religion, ethnic origin, national origin, sex, disability, sexual orientation, or gender identity. If no target is identified, the comment is not hate speech.\n\nStep 2: Assess whether the language expresses **hostility, discrimination, incitement to violence, dehumanization, or derogatory stereotypes** toward the target.\n\nStep 3: Consider **contextual factors** such as sarcasm, historical significance, and coded language. Does the comment still qualify as hate speech when context is considered?\n\nStep 4: Based on the above steps, **conclude whether this is hate speech** (answer only {yn1} or {yn2}).\n No explanations.\nComment: \"{text}\"\n\nAnswer:",

    "translate_then_classify": "Translate the following text from {language} to English:\n\nText: \"{text}\"\n\n\nNow, classify the text as either hateful or non-hateful. No explanations. Respond with {yn1} for hateful and {yn2} for non-hateful.\nAnswer:"

    },
    "es": {
        "answer": "Respuesta:",
        "comment": "Comentario",
        "yes": "sí",
        "hateful": "odioso",
        "no": "no",
        "non_hateful": "no odioso",
        "general": "¿Este comentario es odioso? (no expliques y solo responde con {yn1} o {yn2})\nComentario: \"{text}\"\nRespuesta:",
        "classification": "Aquí hay una publicación en redes sociales: {text}. Clasifica esta publicación como \"sí\" si es odiosa o \"no\" si no lo es. (no expliques y solo responde con {yn1} o {yn2})\nRespuesta:",
        "definition": "El discurso de odio es aquel que ataca a una persona o grupo en función de atributos como raza, religión, origen étnico, nacionalidad, sexo, discapacidad, orientación sexual o identidad de género.\n\n ¿Este comentario es odioso? (no expliques y solo responde con {yn1} o {yn2})\nComentario: \"{text}\"\nRespuesta:",
        "cot": "Analiza el siguiente comentario para determinar si contiene discurso de odio.\n\n Comentario: \"{text}\"\n\n Paso 1: Identificar cualquier lenguaje ofensivo o dañino dirigido a una persona o grupo.\n Paso 2: Determinar si el lenguaje ataca en función de atributos como raza, religión, origen étnico, nacionalidad, sexo, discapacidad, orientación sexual o identidad de género.\n Paso 3: Concluir si es discurso de odio.\n (no expliques y solo responde con {yn1} o {yn2}).\nRespuesta:",
        "few_shot": "Clasifica el siguiente texto como discurso de odio o no discurso de odio. Aquí hay algunos ejemplos:\n\n{examples}\n Ahora, clasifica el siguiente texto:\n\nTexto: \"{text}\"\nRespuesta:",
        "multilingual": "Analiza el siguiente texto escrito en {language} y determina si contiene discurso de odio.  Considera matices culturales y el contexto específico de las comunidades de habla {language}.\n\n Texto: \"{text}\"\n\n ¿Este texto contiene discurso de odio? (no expliques y solo responde con {yn1} o {yn2}).\nRespuesta:",
        "nli": "Premisa: \"{text}\"\nHipótesis: \"Esta declaración expresa discurso de odio.\"\n¿La premisa implica la hipótesis? (no expliques y solo responde con {yn1} o {yn2})\nRespuesta:",
        "role_play": "Imagina que eres un moderador de una comunidad en línea. Tu tarea es garantizar que todo el contenido cumpla con las normas de la comunidad, las cuales prohíben el discurso de odio. Analiza el siguiente texto y determina si infringe estas normas.\n\nTexto: \"{text}\"\n\n¿Este texto infringe las normas de la comunidad sobre discurso de odio? (no expliques y solo responde con {yn1} o {yn2}).\nRespuesta:"
    },
    "ar": {
        "answer": "الإجابة:",
        "comment": "تعليق",
        "yes": "نعم",
        "hateful": "كلام كراهية",
        "no": "لا",
        "non_hateful": "ليس كلام كراهية",
        "general": "هل هذا التعليق يتضمن كلام كراهية؟ (لا تشرح وأجب فقط بـ {yn1} أو {yn2}) تعليق: \"{text}\" الإجابة:",
        "classification": "هذه مشاركة على وسائل التواصل الاجتماعي: {text}. صنف هذه المشاركة بـ \"نعم\" إذا كانت تتضمن كلام كراهية أو \"لا\" إذا لم تكن كذلك. (لا تشرح وأجب فقط بـ {yn1} أو {yn2}) الإجابة:",
        "definition": "خطاب الكراهية هو الكلام الذي يهاجم شخصًا أو مجموعة بناءً على سمات مثل العرق أو الدين أو الأصل العرقي أو الأصل القومي أو الجنس أو الإعاقة أو التوجه الجنسي أو الهوية الجندرية. هل هذا التعليق يتضمن كلام كراهية؟ (لا تشرح وأجب فقط بـ {yn1} أو {yn2}) تعليق: \"{text}\" الإجابة:",
        "cot": "قم بتحليل التعليق التالي لتحديد ما إذا كان يحتوي على خطاب كراهية. التعليق: \"{text}\" الخطوة 1: تحديد أي لغة مسيئة أو ضارة تستهدف شخصًا أو مجموعة. الخطوة 2: تحديد ما إذا كانت اللغة تهاجم بناءً على سمات مثل العرق أو الدين أو الأصل العرقي أو الأصل القومي أو الجنس أو الإعاقة أو التوجه الجنسي أو الهوية الجندرية. الخطوة 3: استنتاج ما إذا كان ذلك خطاب كراهية. (لا تشرح وأجب فقط بـ {yn1} أو {yn2}). الإجابة:",
        "few_shot": "صنف النص التالي على أنه خطاب كراهية أو ليس خطاب كراهية. إليك بعض الأمثلة: {examples} الآن، صنف النص التالي: النص: \"{text}\" الإجابة:",
        "multilingual": "قم بتحليل النص التالي المكتوب باللغة {language} وتحديد ما إذا كان يحتوي على خطاب كراهية. ضع في اعتبارك الفروق الثقافية والسياق الخاص بمجتمعات الناطقين بـ {language}. النص: \"{text}\" هل يحتوي هذا النص على خطاب كراهية؟ (لا تشرح وأجب فقط بـ {yn1} أو {yn2}). الإجابة:",
        "nli": "المقدمة: \"{text}\" الافتراض: \"هذا التصريح يعبر عن خطاب كراهية.\" هل تتضمن المقدمة الافتراض؟ (لا تشرح وأجب فقط بـ {yn1} أو {yn2}) الإجابة:",
        "role_play": "تخيل أنك مشرف في مجتمع عبر الإنترنت. مهمتك هي ضمان التزام جميع المحتويات بإرشادات المجتمع، التي تحظر خطاب الكراهية. قم بتحليل النص التالي وحدد ما إذا كان ينتهك هذه الإرشادات. النص: \"{text}\" هل ينتهك هذا النص إرشادات المجتمع بشأن خطاب الكراهية؟ (لا تشرح وأجب فقط بـ {yn1} أو {yn2}). الإجابة:"
    },
    "it": {
        "answer": "Risposta:",
        "comment": "Commento",
        "yes": "sì",
        "hateful": "odioso",
        "no": "no",
        "non_hateful": "non odioso",
        "general": "Questo commento è odioso? (non spiegare e rispondi solo con {yn1} o {yn2}) Commento: \"{text}\" Risposta:",
        "classification": "Ecco un post sui social media: {text}. Classifica questo post come \"sì\" se è odioso o \"no\" se non lo è. (non spiegare e rispondi solo con {yn1} o {yn2}) Risposta:",
        "definition": "Il discorso d'odio è un discorso che attacca una persona o un gruppo in base ad attributi come razza, religione, origine etnica, nazionalità, sesso, disabilità, orientamento sessuale o identità di genere. Questo commento è odioso? (non spiegare e rispondi solo con {yn1} o {yn2}) Commento: \"{text}\" Risposta:",
        "cot": "Analizza il seguente commento per determinare se contiene discorsi d'odio. Commento: \"{text}\" Passaggio 1: Identifica qualsiasi linguaggio offensivo o dannoso rivolto a una persona o a un gruppo. Passaggio 2: Determina se il linguaggio attacca in base ad attributi come razza, religione, origine etnica, nazionalità, sesso, disabilità, orientamento sessuale o identità di genere. Passaggio 3: Concludi se si tratta di un discorso d'odio. (non spiegare e rispondi solo con {yn1} o {yn2}). Risposta:",
        "few_shot": "Classifica il seguente testo come discorso d'odio o non discorso d'odio. Ecco alcuni esempi: {examples} Ora, classifica il seguente testo: Testo: \"{text}\" Risposta:",
        "multilingual": "Analizza il seguente testo scritto in {language} e determina se contiene discorsi d'odio. Considera le sfumature culturali e il contesto specifico delle comunità di lingua {language}. Testo: \"{text}\" Questo testo contiene discorsi d'odio? (non spiegare e rispondi solo con {yn1} o {yn2}). Risposta:",
        "nli": "Premessa: \"{text}\" Ipotesi: \"Questa affermazione esprime un discorso d'odio.\" La premessa implica l'ipotesi? (non spiegare e rispondi solo con {yn1} o {yn2}) Risposta:",
        "role_play": "Immagina di essere un moderatore di una comunità online. Il tuo compito è garantire che tutti i contenuti rispettino le linee guida della comunità, che vietano i discorsi d'odio. Analizza il seguente testo e determina se viola queste linee guida. Testo: \"{text}\" Questo testo viola le linee guida della comunità sui discorsi d'odio? (non spiegare e rispondi solo con {yn1} o {yn2}). Risposta:"
    },
    "fr": {
        "answer": "Réponse:",
        "comment": "Commentaire",
        "yes": "oui",
        "hateful": "haineux",
        "no": "non",
        "non_hateful": "non haineux",
        "general": "Ce commentaire est-il haineux ? (n'explique pas et réponds uniquement par {yn1} ou {yn2}) Commentaire : \"{text}\" Réponse:",
        "classification": "Voici une publication sur les réseaux sociaux : {text}. Classe cette publication comme \"oui\" si elle est haineuse ou \"non\" si elle ne l'est pas. (n'explique pas et réponds uniquement par {yn1} ou {yn2}) Réponse:",
        "definition": "Le discours de haine est un discours qui attaque une personne ou un groupe en fonction d'attributs tels que la race, la religion, l'origine ethnique, la nationalité, le sexe, le handicap, l'orientation sexuelle ou l'identité de genre. Ce commentaire est-il haineux ? (n'explique pas et réponds uniquement par {yn1} ou {yn2}) Commentaire : \"{text}\" Réponse:",
        "cot": "Analyse le commentaire suivant pour déterminer s'il contient un discours de haine. Commentaire : \"{text}\" Étape 1 : Identifier tout langage offensant ou nuisible visant une personne ou un groupe. Étape 2 : Déterminer si le langage attaque en fonction d'attributs tels que la race, la religion, l'origine ethnique, la nationalité, le sexe, le handicap, l'orientation sexuelle ou l'identité de genre. Étape 3 : Conclure s'il s'agit d'un discours de haine. (n'explique pas et réponds uniquement par {yn1} ou {yn2}). Réponse:",
        "few_shot": "Classe le texte suivant comme discours de haine ou non. Voici quelques exemples : {examples} Maintenant, classe le texte suivant : Texte : \"{text}\" Réponse:",
        "multilingual": "Analyse le texte suivant rédigé en {language} et détermine s'il contient un discours de haine. Prends en compte les nuances culturelles et le contexte spécifique des communautés parlant {language}. Texte : \"{text}\" Ce texte contient-il un discours de haine ? (n'explique pas et réponds uniquement par {yn1} ou {yn2}). Réponse:",
        "nli": "Prémisse : \"{text}\" Hypothèse : \"Cette déclaration exprime un discours de haine.\" La prémisse implique-t-elle l'hypothèse ? (n'explique pas et réponds uniquement par {yn1} ou {yn2}) Réponse:",
        "role_play": "Imagine que tu es modérateur d'une communauté en ligne. Ta tâche est de veiller à ce que tout le contenu respecte les règles de la communauté, qui interdisent les discours de haine. Analyse le texte suivant et détermine s'il viole ces règles. Texte : \"{text}\" Ce texte viole-t-il les règles de la communauté sur le discours de haine ? (n'explique pas et réponds uniquement par {yn1} ou {yn2}). Réponse:"
    },
    "de": {
        "answer": "Antwort:",
        "comment": "Kommentar",
        "yes": "ja",
        "hateful": "hasserfüllt",
        "no": "nein",
        "non_hateful": "nicht hasserfüllt",
        "general": "Ist dieser Kommentar hasserfüllt? (nicht erklären und nur mit {yn1} oder {yn2} antworten) Kommentar: \"{text}\" Antwort:",
        "classification": "Hier ist ein Beitrag aus sozialen Medien: {text}. Klassifiziere diesen Beitrag als \"ja\", wenn er hasserfüllt ist, oder \"nein\", wenn er es nicht ist. (nicht erklären und nur mit {yn1} oder {yn2} antworten) Antwort:",
        "definition": "Hassrede ist eine Äußerung, die eine Person oder Gruppe aufgrund von Merkmalen wie Rasse, Religion, ethnischer Herkunft, Nationalität, Geschlecht, Behinderung, sexueller Orientierung oder geschlechtlicher Identität angreift. Ist dieser Kommentar hasserfüllt? (nicht erklären und nur mit {yn1} oder {yn2} antworten) Kommentar: \"{text}\" Antwort:",
        "cot": "Analysiere den folgenden Kommentar, um festzustellen, ob er Hassrede enthält. Kommentar: \"{text}\" Schritt 1: Identifiziere jede beleidigende oder schädliche Sprache, die sich gegen eine Person oder Gruppe richtet. Schritt 2: Bestimme, ob die Sprache aufgrund von Merkmalen wie Rasse, Religion, ethnischer Herkunft, Nationalität, Geschlecht, Behinderung, sexueller Orientierung oder geschlechtlicher Identität angreift. Schritt 3: Ziehe eine Schlussfolgerung, ob es sich um Hassrede handelt. (nicht erklären und nur mit {yn1} oder {yn2} antworten). Antwort:",
        "few_shot": "Klassifiziere den folgenden Text als Hassrede oder nicht. Hier sind einige Beispiele: {examples} Jetzt klassifiziere den folgenden Text: Text: \"{text}\" Antwort:",
        "multilingual": "Analysiere den folgenden Text, der auf {language} verfasst wurde, und bestimme, ob er Hassrede enthält. Berücksichtige kulturelle Nuancen und den spezifischen Kontext von {language}-sprachigen Gemeinschaften. Text: \"{text}\" Enthält dieser Text Hassrede? (nicht erklären und nur mit {yn1} oder {yn2} antworten). Antwort:",
        "nli": "Prämisse: \"{text}\" Hypothese: \"Diese Aussage stellt Hassrede dar.\" Folgt die Hypothese aus der Prämisse? (nicht erklären und nur mit {yn1} oder {yn2} antworten) Antwort:",
        "role_play": "Stelle dir vor, du bist Moderator einer Online-Community. Deine Aufgabe ist es, sicherzustellen, dass alle Inhalte den Community-Richtlinien entsprechen, die Hassrede verbieten. Analysiere den folgenden Text und bestimme, ob er gegen diese Richtlinien verstößt. Text: \"{text}\" Verstößt dieser Text gegen die Community-Richtlinien zu Hassrede? (nicht erklären und nur mit {yn1} oder {yn2} antworten). Antwort:"
    },
    "hi": {
        "answer": "उत्तर:",
        "comment": "टिप्पणी",
        "yes": "हाँ",
        "hateful": "घृणास्पद",
        "no": "नहीं",
        "non_hateful": "अघृणास्पद",
        "general": "क्या यह टिप्पणी घृणास्पद है? (व्याख्या न करें और केवल {yn1} या {yn2} से उत्तर दें) टिप्पणी: \"{text}\" उत्तर:",
        "classification": "यह एक सोशल मीडिया पोस्ट है: {text}। यदि यह घृणास्पद है, तो इसे \"हाँ\" के रूप में वर्गीकृत करें, अन्यथा \"नहीं\"। (व्याख्या न करें और केवल {yn1} या {yn2} से उत्तर दें) उत्तर:",
        "definition": "घृणास्पद भाषण वह होता है जो किसी व्यक्ति या समूह पर नस्ल, धर्म, जातीयता, राष्ट्रीयता, लिंग, विकलांगता, यौन अभिविन्यास या लिंग पहचान जैसे लक्षणों के आधार पर हमला करता है। क्या यह टिप्पणी घृणास्पद है? (व्याख्या न करें और केवल {yn1} या {yn2} से उत्तर दें) टिप्पणी: \"{text}\" उत्तर:",
        "cot": "निम्नलिखित टिप्पणी का विश्लेषण करें ताकि यह निर्धारित किया जा सके कि इसमें घृणास्पद भाषण है या नहीं। टिप्पणी: \"{text}\" चरण 1: किसी भी आपत्तिजनक या हानिकारक भाषा की पहचान करें जो किसी व्यक्ति या समूह को लक्षित करती है। चरण 2: निर्धारित करें कि क्या यह भाषा नस्ल, धर्म, जातीयता, राष्ट्रीयता, लिंग, विकलांगता, यौन अभिविन्यास या लिंग पहचान के आधार पर हमला करती है। चरण 3: निष्कर्ष निकालें कि क्या यह घृणास्पद भाषण है। (व्याख्या न करें और केवल {yn1} या {yn2} से उत्तर दें)। उत्तर:",
        "few_shot": "निम्नलिखित पाठ को घृणास्पद या अघृणास्पद के रूप में वर्गीकृत करें। यहाँ कुछ उदाहरण दिए गए हैं: {examples} अब, निम्नलिखित पाठ को वर्गीकृत करें: पाठ: \"{text}\" उत्तर:",
        "multilingual": "निम्नलिखित पाठ का विश्लेषण करें जो {language} में लिखा गया है और यह निर्धारित करें कि इसमें घृणास्पद भाषण है या नहीं। {language} भाषी समुदायों की सांस्कृतिक बारीकियों और संदर्भ को ध्यान में रखें। पाठ: \"{text}\" क्या यह पाठ घृणास्पद भाषण है? (व्याख्या न करें और केवल {yn1} या {yn2} से उत्तर दें)। उत्तर:",
        "nli": "प्रस्तावना: \"{text}\" परिकल्पना: \"यह कथन घृणास्पद भाषण व्यक्त करता है।\" क्या प्रस्तावना परिकल्पना को समर्थित करती है? (व्याख्या न करें और केवल {yn1} या {yn2} से उत्तर दें) उत्तर:",
        "role_play": "कल्पना करें कि आप एक ऑनलाइन समुदाय के मॉडरेटर हैं। आपकी ज़िम्मेदारी यह सुनिश्चित करना है कि सभी सामग्री समुदाय के दिशानिर्देशों का पालन करे, जो घृणास्पद भाषण पर प्रतिबंध लगाते हैं। निम्नलिखित पाठ का विश्लेषण करें और निर्धारित करें कि क्या यह इन दिशानिर्देशों का उल्लंघन करता है। पाठ: \"{text}\" क्या यह पाठ समुदाय के घृणास्पद भाषण के दिशानिर्देशों का उल्लंघन करता है? (व्याख्या न करें और केवल {yn1} या {yn2} से उत्तर दें)। उत्तर:"
    },
    "tr": {
        "answer": "Cevap:",
        "comment": "Yorum",
        "yes": "evet",
        "hateful": "nefret dolu",
        "no": "hayır",
        "non_hateful": "nefret dolu değil",
        "general": "Bu yorum nefret dolu mu? (açıklama yapma ve sadece {yn1} veya {yn2} ile cevap ver) Yorum: \"{text}\" Cevap:",
        "classification": "İşte bir sosyal medya gönderisi: {text}. Eğer nefret doluysa \"evet\", değilse \"hayır\" olarak sınıflandır. (açıklama yapma ve sadece {yn1} veya {yn2} ile cevap ver) Cevap:",
        "definition": "Nefret söylemi, bir kişiye veya gruba ırk, din, etnik köken, milliyet, cinsiyet, engellilik, cinsel yönelim veya cinsiyet kimliği gibi özelliklere dayalı olarak saldıran ifadelerdir. Bu yorum nefret dolu mu? (açıklama yapma ve sadece {yn1} veya {yn2} ile cevap ver) Yorum: \"{text}\" Cevap:",
        "cot": "Aşağıdaki yorumu analiz ederek nefret söylemi içerip içermediğini belirle. Yorum: \"{text}\" Adım 1: Bir kişi veya grubu hedef alan saldırgan veya zararlı dili belirle. Adım 2: Dilin ırk, din, etnik köken, milliyet, cinsiyet, engellilik, cinsel yönelim veya cinsiyet kimliği gibi özelliklere dayalı olarak saldırı içerip içermediğini değerlendir. Adım 3: Bunun nefret söylemi olup olmadığına karar ver. (açıklama yapma ve sadece {yn1} veya {yn2} ile cevap ver). Cevap:",
        "few_shot": "Aşağıdaki metni nefret söylemi veya değil olarak sınıflandır. İşte bazı örnekler: {examples} Şimdi aşağıdaki metni sınıflandır: Metin: \"{text}\" Cevap:",
        "multilingual": "{language} dilinde yazılmış aşağıdaki metni analiz ederek nefret söylemi içerip içermediğini belirle. {language} konuşan topluluklara özgü kültürel farklılıkları ve bağlamı göz önünde bulundur. Metin: \"{text}\" Bu metin nefret söylemi içeriyor mu? (açıklama yapma ve sadece {yn1} veya {yn2} ile cevap ver). Cevap:",
        "nli": "Öncül: \"{text}\" Varsayım: \"Bu ifade nefret söylemi içeriyor.\" Öncül, varsayımı destekliyor mu? (açıklama yapma ve sadece {yn1} veya {yn2} ile cevap ver) Cevap:",
        "role_play": "Bir çevrimiçi topluluğun moderatörü olduğunu hayal et. Görevin, tüm içeriklerin nefret söylemini yasaklayan topluluk kurallarına uygun olmasını sağlamaktır. Aşağıdaki metni analiz ederek bu kuralları ihlal edip etmediğini belirle. Metin: \"{text}\" Bu metin, topluluk kurallarındaki nefret söylemi yasağını ihlal ediyor mu? (açıklama yapma ve sadece {yn1} veya {yn2} ile cevap ver). Cevap:"
    },
    "pt": {
        "answer": "Resposta:",
        "comment": "Comentário",
        "yes": "sim",
        "hateful": "ofensivo",
        "no": "não",
        "non_hateful": "não ofensivo",
        "general": "Este comentário é ofensivo? (não explique e responda apenas com {yn1} ou {yn2}) Comentário: \"{text}\" Resposta:",
        "classification": "Aqui está uma publicação em uma rede social: {text}. Classifique esta publicação como \"sim\" se for ofensiva ou \"não\" se não for. (não explique e responda apenas com {yn1} ou {yn2}) Resposta:",
        "definition": "Discurso de ódio é qualquer fala que ataque uma pessoa ou grupo com base em características como raça, religião, origem étnica, nacionalidade, gênero, deficiência, orientação sexual ou identidade de gênero. Este comentário é ofensivo? (não explique e responda apenas com {yn1} ou {yn2}) Comentário: \"{text}\" Resposta:",
        "cot": "Analise o seguinte comentário para determinar se contém discurso de ódio. Comentário: \"{text}\" Passo 1: Identifique qualquer linguagem ofensiva ou prejudicial direcionada a uma pessoa ou grupo. Passo 2: Determine se a linguagem ataca com base em características como raça, religião, origem étnica, nacionalidade, gênero, deficiência, orientação sexual ou identidade de gênero. Passo 3: Conclua se é um discurso de ódio. (não explique e responda apenas com {yn1} ou {yn2}). Resposta:",
        "few_shot": "Classifique o seguinte texto como discurso de ódio ou não. Aqui estão alguns exemplos: {examples} Agora, classifique o seguinte texto: Texto: \"{text}\" Resposta:",
        "multilingual": "Analise o seguinte texto escrito em {language} e determine se contém discurso de ódio. Considere as nuances culturais e o contexto específico das comunidades falantes de {language}. Texto: \"{text}\" Este texto contém discurso de ódio? (não explique e responda apenas com {yn1} ou {yn2}). Resposta:",
        "nli": "Premissa: \"{text}\" Hipótese: \"Esta declaração expressa discurso de ódio.\" A premissa implica a hipótese? (não explique e responda apenas com {yn1} ou {yn2}) Resposta:",
        "role_play": "Imagine que você é um moderador de uma comunidade online. Sua tarefa é garantir que todo o conteúdo siga as diretrizes da comunidade, que proíbem discurso de ódio. Analise o seguinte texto e determine se ele viola essas diretrizes. Texto: \"{text}\" Este texto viola as diretrizes da comunidade sobre discurso de ódio? (não explique e responda apenas com {yn1} ou {yn2}). Resposta:"
    }







}
